experiments/results/logs/burst-hpa-009/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 6240.829ms, rate sampling interval: 15515ms
  Thread calibration: mean lat.: 6409.912ms, rate sampling interval: 18513ms
  Thread calibration: mean lat.: 6062.407ms, rate sampling interval: 15712ms
  Thread calibration: mean lat.: 6095.749ms, rate sampling interval: 14106ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94m    26.82s    1.71m    59.01%
    Req/Sec     3.28      0.45     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93m 
 75.000%    1.32m 
 90.000%    1.58m 
 99.000%    1.70m 
 99.900%    1.71m 
 99.990%    1.71m 
 99.999%    1.71m 
100.000%    1.71m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10567.679     0.000000            1         1.00
   19283.967     0.100000          172         1.11
   28753.919     0.200000          341         1.25
   38928.383     0.300000          510         1.43
   47349.759     0.400000          681         1.67
   55771.135     0.500000          849         2.00
   59932.671     0.550000          934         2.22
   64487.423     0.600000         1019         2.50
   68943.871     0.650000         1105         2.86
   73924.607     0.700000         1189         3.33
   78970.879     0.750000         1275         4.00
   81133.567     0.775000         1316         4.44
   83623.935     0.800000         1361         5.00
   85983.231     0.825000         1402         5.71
   87949.311     0.850000         1445         6.67
   92078.079     0.875000         1487         8.00
   93716.479     0.887500         1507         8.89
   94502.911     0.900000         1529        10.00
   95551.487     0.912500         1550        11.43
   96862.207     0.925000         1574        13.33
   97845.247     0.937500         1592        16.00
   99549.183     0.943750         1604        17.78
  100270.079     0.950000         1615        20.00
  100466.687     0.956250         1625        22.86
  100597.759     0.962500         1636        26.67
  100728.831     0.968750         1646        32.00
  101056.511     0.971875         1651        35.56
  101318.655     0.975000         1656        40.00
  101449.727     0.978125         1665        45.71
  101515.263     0.981250         1673        53.33
  101515.263     0.984375         1673        64.00
  101580.799     0.985938         1675        71.11
  101646.335     0.987500         1679        80.00
  101711.871     0.989062         1683        91.43
  101711.871     0.990625         1683       106.67
  101777.407     0.992188         1687       128.00
  101777.407     0.992969         1687       142.22
  101842.943     0.993750         1689       160.00
  101842.943     0.994531         1689       182.86
  102170.623     0.995313         1691       213.33
  102498.303     0.996094         1694       256.00
  102498.303     0.996484         1694       284.44
  102498.303     0.996875         1694       320.00
  102498.303     0.997266         1694       365.71
  102629.375     0.997656         1695       426.67
  102629.375     0.998047         1695       512.00
  102694.911     0.998242         1697       568.89
  102694.911     0.998437         1697       640.00
  102694.911     0.998633         1697       731.43
  102694.911     0.998828         1697       853.33
  102694.911     0.999023         1697      1024.00
  102694.911     0.999121         1697      1137.78
  102694.911     0.999219         1697      1280.00
  102694.911     0.999316         1697      1462.86
  102891.519     0.999414         1698      1706.67
  102891.519     1.000000         1698          inf
#[Mean    =    56189.980, StdDeviation   =    26817.178]
#[Max     =   102825.984, Total count    =         1698]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1800 requests in 2.00m, 18.46MB read
  Socket errors: connect 0, read 0, write 0, timeout 4175
Requests/sec:     14.98
Transfer/sec:    157.30KB